CSI API ETABS v1

# cPointObjGetSpecialPoint Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSpecialPoint(
    	string Name,
    	ref bool SpecialPoint
    )

    Function GetSpecialPoint (
    	Name As String,
    	ByRef SpecialPoint As Boolean
    ) As Integer

    Dim instance As cPointObj
    Dim Name As String
    Dim SpecialPoint As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetSpecialPoint(Name,
    	SpecialPoint)

    int GetSpecialPoint(
    	String^ Name,
    	bool% SpecialPoint
    )

    abstract GetSpecialPoint :
            Name : string *
            SpecialPoint : bool byref -> int

#### Parameters

Name

    Type: SystemString

SpecialPoint

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cPointObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com